app/views/home/home.html.erb

            <article class="comment-single">
              <% user = @users.find(c.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]