app/controllers/home_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 30]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    if params[:commit] == "Delete account"
      reset_session
      User.find(@current_user.id).destroy
      redirect_to sessions_index_path, primary: "Your account is deleted."
    elsif params[:commit] == "Reset image"
      # Creates a new user using the passed parameters.
      @user = User.find(@current_user.id)
      file = File.open(@@default_profile_picture_path)
      if @user.update_attribute(:image, file)
        redirect_to home_profile_path, success: "You have successfully set your profile picture to the default!"
      end
      file.close
      # If the user hasn't uploaded a profile picture,
      # it gets set to the default image.
    elsif params['user']['image'] == nil
      @user = User.find(params['user']['id'])
      @user.update_attributes(username: params['user']['username'], firstname: params['user']['firstname'], lastname: params['user']['lastname'])
      redirect_to home_home_path, success: "You have successfully updated your profile!"
      # If the user has uploaded a profile picture it gets saved now.
    else
      @user = User.find(params['user']['id'])

INSERT INTO "likes" ("created_at", "updated_at", "user_id", "picture_id") VALUES (?, ?, ?, ?)  [["created_at", "2020-10-08 13:19:12.494271"], ["updated_at", "2020-10-08 13:19:12.494271"], ["user_id", 16], ["picture_id", 5]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
INSERT INTO "comments" ("comment", "created_at", "updated_at", "user_id", "picture_id") VALUES (?, ?, ?, ?, ?)  [["comment", "Hello"], ["created_at", "2020-10-08 13:23:50.412687"], ["updated_at", "2020-10-08 13:23:50.412687"], ["user_id", 18], ["picture_id", 5]]
---
  def create
    if params[:commit] == "Upload picture"
      @picture = Picture.new(picture_params)
      # Checks if the picture can be saved,
      # and if so, it does that.
      if @picture.save
        redirect_to home_home_path, success: "You have successfully uploaded your picture."
      else
        redirect_to home_home_path, danger: "Try it again, the picture couldn't be uploaded."
      end

    elsif params[:commit] == "Like"
      like = Like.new(like_params)
      # Checks if the like can be saved,
      # and if so, it does that.
      if like.save
        redirect_to home_home_path, success: "You have successfully liked #{params['like']['picture_id']}!"
      end

    elsif params[:commit] == "Unlike"
      likes = Like.all
      # Picks the like based of the parameters and deletes(destroys) it.
      likes.find_by(like_params).destroy
      redirect_to home_home_path, success: "You have successfully unliked #{params['like']['picture_id']}!"

    else
      params[:commit] == "create comment"
      comment = Comment.new(comment: params['comment']['comment'], user_id: @current_user.id, picture_id: params['comment']['picture_id'])
      # Checks if the comment can be saved,
      # and if so, it does that.
      if comment.save