app/controllers/home_controller.rb

SELECT "pictures".* FROM "pictures"
SELECT "comments".* FROM "comments"
---
  def home
    @pictures = Picture.all
    @comments = Comment.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_file_name", "DSC01390B.JPG"], ["image_file_size", 19441888], ["image_updated_at", "2020-10-07 09:16:36.551836"], ["updated_at", "2020-10-07 09:16:36.576669"], ["id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "daniel schmitz"], ["image_file_name", nil], ["image_content_type", nil], ["image_file_size", nil], ["image_updated_at", nil], ["updated_at", "2020-10-07 11:49:50.390218"], ["id", 2]]
---
  def update
    if params[:commit] == "Submit"
      @user = User.find(@current_user.id)
      if @user.update_attributes(image_params)
        redirect_to home_profile_path, success: "You have successfully uploaded your image!"
      else
        redirect_to home_profile_path, danger: "Try it again, the picture couldn't be updated."
      end
    else
      @user = User.find(params['user']['id'])
      @user.update_attributes(username: params['user']['username'], firstname: params['user']['firstname'], lastname: params['user']['lastname'], image: params['user']['image'])

INSERT INTO "pictures" ("created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "likes" ("created_at", "updated_at", "user_id", "picture_id") VALUES (?, ?, ?, ?)  [["created_at", "2020-10-08 06:22:19.622944"], ["updated_at", "2020-10-08 06:22:19.622944"], ["user_id", 1], ["picture_id", 4]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 7]]
INSERT INTO "comments" ("comment", "created_at", "updated_at", "user_id", "picture_id") VALUES (?, ?, ?, ?, ?)  [["comment", "Test"], ["created_at", "2020-10-06 13:19:15.403631"], ["updated_at", "2020-10-06 13:19:15.403631"], ["user_id", 2], ["picture_id", 1]]
---
  def create
    if params[:commit] == "Upload picture"
      @picture = Picture.new(picture_params)
      if @picture.save
        redirect_to home_home_path, success: "You have successfully uploaded your picture."
      else
        redirect_to home_home_path, danger: "Try it again, the picture couldn't be uploaded."
      end

    elsif params[:commit] == "Like"
      like = Like.new(like_params)
      if like.save
        redirect_to home_home_path, success: "You have successfully liked #{params['like']['picture_id']}!"
      end

    elsif params[:commit] == "Unlike"
      likes = Like.all
      likes.find_by(like_params).destroy
      redirect_to home_home_path, success: "You have successfully unliked #{params['like']['picture_id']}!"

    else params[:commit] == "create comment"
      comment = Comment.new(comment: params['comment']['comment'], user_id: @current_user.id, picture_id: params['comment']['picture_id'])
      if comment.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    reset_session
    User.find(@current_user.id).destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "users" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_file_name", "DSC00697-HDRB.JPG"], ["image_file_size", 12556190], ["image_updated_at", "2020-10-08 09:14:34.062568"], ["updated_at", "2020-10-08 09:14:34.078092"], ["id", 2]]
---
  def default_image
    @user = User.find(@current_user.id)
    file = File.open("/home/aaron/Pictures/Screenshot from 2020-10-05 10-14-01.png")
    if @user.update_attribute(:image, file)