app/controllers/registrations_controller.rb

  def create
    user = User.new(email: params['user']['email'],
                    password: params['user']['password'],
                    password_confirmation: params['user']['password_confirmation'],
                    username: params['user']['username'],
                    firstname: params['user']['firstname'],
                    lastname: params['user']['lastname'])
    if params['user']['image'] != nil
      # If the user has uploaded a profile picture,
      # it gets stored in the user variable.
      user.image = params['user']['image']
    else
      # If the user hasn't uploaded a profile picture,
      # the default profile picture gets stored in the user variable.
      file = File.open(@@default_profile_picture_path)
      user.image = file
      file.close
    end

    # Checks if the user can be saved,
    # and if so it does that.
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "username", "firstname", "lastname", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)