app/controllers/sessions_controller.rb

  def create
    #Trys to authenticate the user with the email and password that comes along.
    user = User.find_by(email: params["user"]["email"]).try(:authenticate, params["user"]["password"])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "aaron@familiehari.ch"], ["LIMIT", 1]]