app/controllers/concerns/current_user_concern.rb

  def set_current_user
    if session[:user_id]
      @current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]